; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	infrared4 - mode
	image3 - mode
	thermograph0 - mode
	spectrograph5 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	Planet3 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph0)
	(supports instrument0 image3)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Planet3 thermograph0)
	(have_image Planet4 thermograph0)
	(have_image Star5 infrared2)
	(have_image Star5 thermograph0)
	(have_image Star6 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
2. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet3)
   goals met: 0 of 6
5. (take_image satellite0 planet3 instrument0 thermograph0)
   added: (have_image planet3 thermograph0)
   goals met: 1 of 6
6. (turn_to satellite0 planet4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet4)
   goals met: 1 of 6
7. (take_image satellite0 planet4 instrument0 thermograph0)
   added: (have_image planet4 thermograph0)
   goals met: 2 of 6
8. (turn_to satellite0 star5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
9. (take_image satellite0 star5 instrument0 infrared2)
   added: (have_image star5 infrared2)
   goals met: 3 of 6
10. (take_image satellite0 star5 instrument0 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 4 of 6
11. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 5 of 6
12. (take_image satellite0 star6 instrument0 infrared2)
   added: (have_image star6 infrared2)
   goals met: 6 of 6
